#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/teste-carla/novo-workspace/runs/run-Y87S1pxQgS7zR4br

Waiting for the plan to start...

Terraform v1.9.5
on linux_amd64
Initializing plugins and modules...
aws_eks_cluster.tech: Refreshing state... [id=tech]
aws_eks_node_group.techNode: Refreshing state... [id=tech:techNode]
aws_eks_cluster.tech: Drift detected (delete)
aws_eks_node_group.techNode: Drift detected (delete)

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_eks_cluster.tech has been deleted
  - resource "aws_eks_cluster" "tech" {
      - certificate_authority = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJSHhOd1Z5TTJMZTh3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TkRBNU1UZ3hPVEl6TWpWYUZ3MHpOREE1TVRZeE9USTRNalZhTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUURGZGZ5OUJUT1RsYXpqaTdLQUhZbjRuT0xrSFFhWGEzNyt2RzdGUkFLVHVyYThuY05mODFncGhacTQKaldjMnV5SnVCUE12MEhKeWh2V2NWRlNBR2NkTkNocXNiS21TN081TmZVK09lRGJhVzhCc21aZkdsbTgzb1FzZgo2dS9kS3lTOTBiL2pmZGlCMWk3TWkxeFZmWXNpTlRYc0xOZllOc21xZ01zQUxTNTBnNEppUGhkRFo3R21zNXYzCkhkYmtCYWRsQmpkWm5qVk95WExWNGl6K1NSQ09ycVppM3RDUlVGeXJONUdxL2FNV25lS05kam5hVzFwNmF2ejMKY2lTdDFmaHRVM0dvaFVNV3BqeTNLUTBmVzFmek9GVXN6anBIMmRwVGpSUGRSYU8wUGM2em5jV2d0Nm5TdDJSbAppNkpVaU4yRDd4dmkzZ1dONlFtbjRuYXhNWWhIQWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJTVHV5WUpCRTE2MXo1eVpENXRKQTdGcTJtbHpUQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQmFlZG9BTkhGOQpYYlU5b1p2VU9xOE9idTNQSHcwNmVsb3l0bENyNkdhN2RKcW5KYWNPVVZva3A2Zk53YjVBSFlYR05IVmVCMXkzCjZuaXdkUW1DMVM3cmdmWTNHeVUzNnFmeEZwdExsNDZXSENPajBQbHI5SUo1YU9MS3EyVTd2L1ZiVnpFR0QwVFAKditiOVcxZFBFczFkb3YxaTRJSlc0Vmw5SS9hV1o1azh2SE5nTFhwWkV1cHBwNFN0aHF5dTZBOHJzRXlXRDdhSQpselROYVV3MkhUZTJKMGNlYTViL3grdTBNVEEyQXhhTVdlY1d6TGI2RnlOLzBScFduSHhYQmZ1aDEzdlJQa2xrCjJOR1RGUEZFZHd5OVdNaC8zdlBJeHR2QkxpN0k5TDBESzNDaWpKN3ZOSWFlV0pTdjAwY2RKUlBaUHJKa1NaaTUKWk1KR0JUQUhaOHNXCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
            },
        ] -> null
      - endpoint              = "https://CB9117B6A8B391B0581533E0FE2A5896.gr7.us-east-1.eks.amazonaws.com" -> null
        id                    = "tech"
      - name                  = "tech" -> null
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eks_cluster.tech will be created
  + resource "aws_eks_cluster" "tech" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + cluster_id            = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "tech"
      + platform_version      = (known after apply)
      + role_arn              = "arn:aws:iam::019248244455:role/LabRole"
      + status                = (known after apply)
      + tags_all              = (known after apply)
      + version               = (known after apply)

      + kubernetes_network_config (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + subnet_ids                = [
              + "subnet-01d3059e23aa6d6d7",
              + "subnet-023821714e99975f0",
              + "subnet-04a1a10cbf10df2bb",
              + "subnet-057bd241945828c79",
              + "subnet-067058a4f0e40dbdd",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.techNode will be created
  + resource "aws_eks_node_group" "techNode" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "tech"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.small",
        ]
      + node_group_name        = "techNode"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::019248244455:role/LabRole"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-01d3059e23aa6d6d7",
          + "subnet-023821714e99975f0",
          + "subnet-04a1a10cbf10df2bb",
          + "subnet-057bd241945828c79",
          + "subnet-067058a4f0e40dbdd",
        ]
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 1
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ endpoint                              = "https://CB9117B6A8B391B0581533E0FE2A5896.gr7.us-east-1.eks.amazonaws.com" -> (known after apply)
  ~ kubeconfig-certificate-authority-data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJSHhOd1Z5TTJMZTh3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TkRBNU1UZ3hPVEl6TWpWYUZ3MHpOREE1TVRZeE9USTRNalZhTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUURGZGZ5OUJUT1RsYXpqaTdLQUhZbjRuT0xrSFFhWGEzNyt2RzdGUkFLVHVyYThuY05mODFncGhacTQKaldjMnV5SnVCUE12MEhKeWh2V2NWRlNBR2NkTkNocXNiS21TN081TmZVK09lRGJhVzhCc21aZkdsbTgzb1FzZgo2dS9kS3lTOTBiL2pmZGlCMWk3TWkxeFZmWXNpTlRYc0xOZllOc21xZ01zQUxTNTBnNEppUGhkRFo3R21zNXYzCkhkYmtCYWRsQmpkWm5qVk95WExWNGl6K1NSQ09ycVppM3RDUlVGeXJONUdxL2FNV25lS05kam5hVzFwNmF2ejMKY2lTdDFmaHRVM0dvaFVNV3BqeTNLUTBmVzFmek9GVXN6anBIMmRwVGpSUGRSYU8wUGM2em5jV2d0Nm5TdDJSbAppNkpVaU4yRDd4dmkzZ1dONlFtbjRuYXhNWWhIQWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJTVHV5WUpCRTE2MXo1eVpENXRKQTdGcTJtbHpUQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQmFlZG9BTkhGOQpYYlU5b1p2VU9xOE9idTNQSHcwNmVsb3l0bENyNkdhN2RKcW5KYWNPVVZva3A2Zk53YjVBSFlYR05IVmVCMXkzCjZuaXdkUW1DMVM3cmdmWTNHeVUzNnFmeEZwdExsNDZXSENPajBQbHI5SUo1YU9MS3EyVTd2L1ZiVnpFR0QwVFAKditiOVcxZFBFczFkb3YxaTRJSlc0Vmw5SS9hV1o1azh2SE5nTFhwWkV1cHBwNFN0aHF5dTZBOHJzRXlXRDdhSQpselROYVV3MkhUZTJKMGNlYTViL3grdTBNVEEyQXhhTVdlY1d6TGI2RnlOLzBScFduSHhYQmZ1aDEzdlJQa2xrCjJOR1RGUEZFZHd5OVdNaC8zdlBJeHR2QkxpN0k5TDBESzNDaWpKN3ZOSWFlV0pTdjAwY2RKUlBaUHJKa1NaaTUKWk1KR0JUQUhaOHNXCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @CarlaCCP, Action: `pull_request`*